# -*- coding: utf-8 -*-
import urllib2
import urllib  
import simplejson as json  
import time
import os
import socket
import random
import threading
import sh
import sz
import common_api
import gen_excel


class HttpRedirect_Handler(urllib2.HTTPRedirectHandler):
	def http_error_302(self, req, fp, code, msg, headers):
		#global step3_p_skey
		#print "@@@@@@@@@@@@@ get it @@@@@@@@@@@"
		#step3_p_skey=find_cookie_str(headers.get('Set-Cookie'), "p_skey");
		#print step3_p_skey
		#return urllib2.HTTPRedirectHandler.http_error_302(self, req, fp, code, msg, headers)
		pass

opener = urllib2.build_opener(urllib2.HTTPCookieProcessor(),HttpRedirect_Handler())

def my_url_read_data(url, body_values, headers, stimeout=10):
	print url
	global opener
	out_cookies=""
	the_page=""
	req = urllib2.Request(url, body_values, headers)
	try:
		if stimeout == 0:
			response = opener.open(req)
		else:
			response = opener.open(req,timeout=stimeout)
		the_page = response.read()
		if response.info().has_key('Set-Cookie'):
			out_cookies = response.info()['Set-Cookie']
		#print response.info();
	except:
		print '@@@@@@@@@@@@@@@@@@ error @@@@@@@@@@@@@@@@@@@@@@ at: ' + url; 
	#print "read out: " + the_page
	return [the_page,out_cookies]

user_agent='Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/44.0.2403.125 Safari/537.36'
refstr='http://www.sse.com.cn/disclosure/diclosure/public/'
headers = { 'User-Agent' : user_agent,
			'Referer' : refstr,
			'Connection' : 'keep-alive',
			}
http_body = None
url='http://query.sse.com.cn/infodisplay/showTradePublicFile.do?jsonCallBack=jQuery172007153944508172572_1449041339236&dateTx=2015-12-02&random=0.983882803004235&_=1449041354010'
#data=my_url_read_data(url, http_body, headers)[0]
data='''jQuery172007153944508172572_1449041339239({"actionErrors":[],"actionMessages":[],"dateTx":"2015-12-01","errorMessages":[],"errors":{},"fieldErrors":{},"fileContents":["            上海证券交易所每日交易信息","","交易日期:2015年12月01日","","","一、有价格涨跌幅限制的日收盘价格涨幅偏离值达到7%的前三只证券:"," 1、A股","        证券代码      证券简称      偏离值%        成交量        成交金额(万元)","    (1)  600575      皖江物流      9.75%        74074424           47475.31","    (2)  601011      宝泰隆        9.74%        66459060           67377.82","    (3)  601339      百隆东方      9.74%        71736223           61081.58","","      证券代码: 600575                                            证券简称: 皖江物流","      ------------------------------------------------------------------------------","      买入营业部名称:                                              累计买入金额(元):","  (1) 机构专用                                                           74337490.26","  (2) 机构专用                                                           51257091.00","  (3) 东吴证券股份有限公司苏州石路证券营业部                              6600814.80","  (4) 国联证券股份有限公司无锡中山路证券营业部                            6198121.04","  (5) 光大证券股份有限公司宁波解放南路证券营业部                          4208522.50","","      卖出营业部名称:                                              累计卖出金额(元):","  (1) 中信建投证券股份有限公司大连市同兴街证券营业部                     11705016.00","  (2) 东吴证券股份有限公司苏州石路证券营业部                              9197958.80","  (3) 万联证券有限责任公司广州花蕾路证券营业部                            8449850.00","  (4) 招商证券股份有限公司济南泉城路证券营业部                            6886596.00","  (5) 长城证券股份有限公司深圳宝安海秀路证券营业部                        4762800.00","","      证券代码: 601011                                            证券简称: 宝泰隆  ","      ------------------------------------------------------------------------------","      买入营业部名称:                                              累计买入金额(元):","  (1) 机构专用                                                          146265868.85","  (2) 机构专用                                                          109656851.20","  (3) 申万宏源证券有限公司瑞安安盛路证券营业部                           11735244.30","  (4) 国泰君安证券股份有限公司深圳分公司                                 11378920.80","  (5) 国泰君安证券股份有限公司深圳人民南路证券营业部                     10557386.00","","      卖出营业部名称:                                              累计卖出金额(元):","  (1) 中信证券股份有限公司上海恒丰路证券营业部                           37712956.69","  (2) 中信建投证券股份有限公司杭州庆春路证券营业部                       21047971.10","  (3) 国元证券股份有限公司青岛辽宁路证券营业部                           11752800.99","  (4) 华泰证券股份有限公司哈尔滨宣化街证券营业部                         11647402.00","  (5) 江海证券有限公司七台河景丰路证券营业部                             11499000.00","","      证券代码: 601339                                            证券简称: 百隆东方","      ------------------------------------------------------------------------------","      买入营业部名称:                                              累计买入金额(元):","  (1) 机构专用                                                           51198089.80","  (2) 中国银河证券股份有限公司宁波解放南路证券营业部                     44837557.00","  (3) 兴业证券股份有限公司福州湖东路证券营业部                           21527632.00","  (4) 方正证券股份有限公司上海保定路证券营业部                           21279564.86","  (5) 华泰证券股份有限公司绍兴上大路证券营业部                           20035084.20","","      卖出营业部名称:                                              累计卖出金额(元):","  (1) 国都证券股份有限公司北京北三环中路证券营业部                       19958834.00","  (2) 机构专用                                                           19600222.32","  (3) 沪股通专用                                                          8455265.00","  (4) 长城证券股份有限公司杭州世纪大道证券营业部                          7456582.00","  (5) 华泰证券股份有限公司扬州宝应叶挺东路证券营业部                      5524051.00",""," 2、B股",""," 3、封闭式基金","","二、有价格涨跌幅限制的日收盘价格跌幅偏离值达到7%的前三只证券:"," 1、A股","        证券代码      证券简称      偏离值%        成交量        成交金额(万元)","    (1)  600392      盛和资源      -10.34%        71295281           97195.06","    (2)  600112      天成控股      -10.34%        77305273          157352.75","    (3)  600882      华联矿业      -10.33%        39023920           42990.78","","      证券代码: 600392                                            证券简称: 盛和资源","      ------------------------------------------------------------------------------","      买入营业部名称:                                              累计买入金额(元):","  (1) 中国中投证券有限责任公司常州劳动西路证券营业部                     14616871.28","  (2) 中信证券(山东)有限责任公司青岛南京路证券营业部                      9785291.02","  (3) 财通证券股份有限公司北京成府路证券营业部                            9188042.72","  (4) 海通证券股份有限公司武汉十升路证券营业部                            8965836.96","  (5) 中泰证券股份有限公司泰安东岳大街第一证券营业部                      7588345.50","","      卖出营业部名称:                                              累计卖出金额(元):","  (1) 国泰君安证券股份有限公司深圳福华三路证券营业部                     17067480.00","  (2) 中国国际金融有限公司上海淮海中路证券营业部                         13971775.39","  (3) 华泰证券股份有限公司成都蜀金路证券营业部                           13597352.00","  (4) 中信建投证券股份有限公司杭州庆春路证券营业部                       11407543.45","  (5) 民生证券股份有限公司信用交易部                                     11330256.08","","      证券代码: 600112                                            证券简称: 天成控股","      ------------------------------------------------------------------------------","      买入营业部名称:                                              累计买入金额(元):","  (1) 渤海证券股份有限公司苏州景德路证券营业部                           39632495.50","  (2) 国泰君安证券股份有限公司宁波彩虹北路证券营业部                     27216486.97","  (3) 国海证券股份有限公司山东分公司                                     18760506.32","  (4) 中信证券(山东)有限责任公司滨州黄河五路证券营业部                   17481446.00","  (5) 招商证券股份有限公司北京建国路证券营业部                           15143087.00","","      卖出营业部名称:                                              累计卖出金额(元):","  (1) 机构专用                                                           67478755.75","  (2) 中国中投证券有限责任公司广州体育东路证券营业部                     48023549.80","  (3) 中信证券股份有限公司上海溧阳路证券营业部                           39203920.62","  (4) 方正证券股份有限公司台州解放路证券营业部                           34440309.99","  (5) 中信证券股份有限公司上海环球金融中心证券营业部                     26652934.46","","      证券代码: 600882                                            证券简称: 华联矿业","      ------------------------------------------------------------------------------","      买入营业部名称:                                              累计买入金额(元):","  (1) 国泰君安证券股份有限公司顺德东乐路证券营业部                       12946024.00","  (2) 平安证券有限责任公司深圳金田路证券营业部                           10972828.00","  (3) 兴业证券股份有限公司厦门嘉禾路证券营业部                            8892855.00","  (4) 光大证券股份有限公司海口国贸大道证券营业部                          8819918.00","  (5) 中信证券股份有限公司杭州市心南路证券营业部                          8296073.00","","      卖出营业部名称:                                              累计卖出金额(元):","  (1) 国海证券股份有限公司南宁教育路证券营业部                           21310170.07","  (2) 华泰证券股份有限公司上海澳门路证券营业部                           17588890.55","  (3) 招商证券股份有限公司深圳南山南油大道证券营业部                     15976326.73","  (4) 国泰君安证券股份有限公司上海福山路证券营业部                       14569049.24","  (5) 国泰君安证券股份有限公司顺德东乐路证券营业部                       13336922.25",""," 2、B股",""," 3、封闭式基金","","三、有价格涨跌幅限制的日价格振幅达到15%的前三只证券:"," 1、A股","        证券代码      证券简称      振幅%          成交量        成交金额(万元)","    (1)  603300      华铁科技      16.93%        15860796           58577.49","    (2)  600701      工大高新      16.52%        40049053          108778.37","    (3)  600565      迪马股份      16.40%       271035343          297705.27","","      证券代码: 603300                                            证券简称: 华铁科技","      ------------------------------------------------------------------------------","      买入营业部名称:                                              累计买入金额(元):","  (1) 国泰君安证券股份有限公司上海银城中路证券营业部                     16526170.89","  (2) 中国国际金融有限公司深圳福华一路证券营业部                          8874321.06","  (3) 中银国际证券有限责任公司北京宣外大街证券营业部                      7612785.50","  (4) 中国银河证券股份有限公司上海浦东南路证券营业部                      7511657.02","  (5) 方正证券股份有限公司贵阳中华中路证券营业部                          6266363.00","","      卖出营业部名称:                                              累计卖出金额(元):","  (1) 华泰证券股份有限公司舟山解放东路证券营业部                         25966444.68","  (2) 海通证券股份有限公司深圳红岭中路营业部                             23090793.00","  (3) 华泰证券股份有限公司上海黄浦区来福士广场证券营业部                 19397001.23","  (4) 中信建投证券股份有限公司武汉市中北路证券营业部                     11541082.00","  (5) 中国中投证券有限责任公司深圳宝安区创业一路证券营业部               10747381.00","","      证券代码: 600701                                            证券简称: 工大高新","      ------------------------------------------------------------------------------","      买入营业部名称:                                              累计买入金额(元):","  (1) 机构专用                                                          117281373.51","  (2) 安信证券股份有限公司上海世纪大道证券营业部                         29440079.61","  (3) 广发证券股份有限公司深圳南园路证券营业部                           18384441.60","  (4) 机构专用                                                           13872578.00","  (5) 国泰君安证券股份有限公司北京建国路证券营业部                       12386160.76","","      卖出营业部名称:                                              累计卖出金额(元):","  (1) 机构专用                                                           33821446.55","  (2) 机构专用                                                           32381444.86","  (3) 华泰证券股份有限公司杭州庆春路证券营业部                           25978783.39","  (4) 机构专用                                                           19398179.99","  (5) 机构专用                                                           14811900.71","","      证券代码: 600565                                            证券简称: 迪马股份","      ------------------------------------------------------------------------------","      买入营业部名称:                                              累计买入金额(元):","  (1) 万联证券有限责任公司广州东风中路证券营业部                         63032153.00","  (2) 太平洋证券股份有限公司总部                                         52175693.36","  (3) 华泰证券股份有限公司上海澳门路证券营业部                           46529699.00","  (4) 华泰证券股份有限公司沈阳大西路证券营业部                           46318725.00","  (5) 方正证券股份有限公司上海延安西路证券营业部                         29720868.00","","      卖出营业部名称:                                              累计卖出金额(元):","  (1) 机构专用                                                          325920000.00","  (2) 机构专用                                                          242977685.98","  (3) 光大证券股份有限公司上海环城南路证券营业部                        174965411.24","  (4) 中信证券(山东)有限责任公司郑州商务内环路证券营业部                111669571.21","  (5) 机构专用                                                          104103536.60",""," 2、B股",""," 3、封闭式基金","","四、有价格涨跌幅限制的日换手率达到20%的前三只证券:"," 1、A股","        证券代码      证券简称      换手率%        成交量        成交金额(万元)","    (1)  603300      华铁科技      31.30%        15860796           58577.49","    (2)  603599      广信股份      27.00%        12706123           75645.63","    (3)  603030      全筑股份      26.94%        10775433           43503.29","","      证券代码: 603300                                            证券简称: 华铁科技","      ------------------------------------------------------------------------------","      买入营业部名称:                                              累计买入金额(元):","  (1) 国泰君安证券股份有限公司上海银城中路证券营业部                     16526170.89","  (2) 中国国际金融有限公司深圳福华一路证券营业部                          8874321.06","  (3) 中银国际证券有限责任公司北京宣外大街证券营业部                      7612785.50","  (4) 中国银河证券股份有限公司上海浦东南路证券营业部                      7511657.02","  (5) 方正证券股份有限公司贵阳中华中路证券营业部                          6266363.00","","      卖出营业部名称:                                              累计卖出金额(元):","  (1) 华泰证券股份有限公司舟山解放东路证券营业部                         25966444.68","  (2) 海通证券股份有限公司深圳红岭中路营业部                             23090793.00","  (3) 华泰证券股份有限公司上海黄浦区来福士广场证券营业部                 19397001.23","  (4) 中信建投证券股份有限公司武汉市中北路证券营业部                     11541082.00","  (5) 中国中投证券有限责任公司深圳宝安区创业一路证券营业部               10747381.00","","      证券代码: 603599                                            证券简称: 广信股份","      ------------------------------------------------------------------------------","      买入营业部名称:                                              累计买入金额(元):","  (1) 海通证券股份有限公司杭州解放路证券营业部                           10133444.44","  (2) 华泰证券股份有限公司上海天钥桥路证券营业部                          6659803.00","  (3) 财通证券股份有限公司绍兴县柯桥湖西路证券营业部                      5996307.00","  (4) 国金证券股份有限公司上海互联网证券分公司                            5073670.00","  (5) 平安证券有限责任公司深圳深南东路罗湖商务中心证券营业部              4134189.08","","      卖出营业部名称:                                              累计卖出金额(元):","  (1) 华泰证券股份有限公司深圳益田路荣超商务中心证券营业部               12596938.32","  (2) 华泰证券股份有限公司厦门厦禾路证券营业部                           10686821.10","  (3) 国金证券股份有限公司上海互联网证券分公司                            9180053.50","  (4) 海通证券股份有限公司广州东风西路证券营业部                          8310564.90","  (5) 东兴证券股份有限公司邵武五一九路证券营业部                          8107124.00","","      证券代码: 603030                                            证券简称: 全筑股份","      ------------------------------------------------------------------------------","      买入营业部名称:                                              累计买入金额(元):","  (1) 中信建投证券股份有限公司北京亦庄荣华中路证券营业部                  8324683.90","  (2) 招商证券股份有限公司上海肇嘉浜路证券营业部                          7691748.00","  (3) 广发证券股份有限公司潮州潮枫路证券营业部                            6575065.00","  (4) 国信证券股份有限公司上海北京东路证券营业部                          5108203.00","  (5) 海通证券股份有限公司上海平武路证券营业部                            3857826.00","","      卖出营业部名称:                                              累计卖出金额(元):","  (1) 国泰君安证券股份有限公司深圳益田路证券营业部                       20349730.00","  (2) 华泰证券股份有限公司成都蜀金路证券营业部                           15698869.00","  (3) 银泰证券有限责任公司上海嘉善路证券营业部                            7204547.48","  (4) 华泰证券股份有限公司天津东丽开发区二纬路证券营业部                  4931990.00","  (5) 国信证券股份有限公司成都二环路证券营业部                            4572828.00",""," 2、B股",""," 3、封闭式基金","","五、无价格涨跌幅限制的证券:"," 1、A股",""," 2、B股",""," 3、封闭式基金","","六、非ST、*ST和S证券连续三个交易日内收盘价格涨幅偏离值累计达到20%的证券:"," 1、A股","        证券代码  证券简称  累计偏离值%  累计成交量  累计成交金额(万元)  异常期间","    (1)  600077   宋都股份  +22.10%       188324670          151377.78  11.27-12.01","","      证券代码: 600077                                            证券简称: 宋都股份","      ------------------------------------------------------------------------------","      买入营业部名称:                                              累计买入金额(元):","  (1) 机构专用                                                           80735255.64","  (2) 机构专用                                                           60766869.25","  (3) 机构专用                                                           22986502.41","  (4) 海通证券股份有限公司国际部                                         21641943.25","  (5) 中国银河证券股份有限公司金华证券营业部                             17365520.00","","      卖出营业部名称:                                              累计卖出金额(元):","  (1) 招商证券股份有限公司上海肇嘉浜路证券营业部                         31148533.00","  (2) 广发证券股份有限公司杭州天目山路证券营业部                         17737849.00","  (3) 海通证券股份有限公司绍兴劳动路营业部                               16315123.32","  (4) 银泰证券有限责任公司上海嘉善路证券营业部                           15069378.00","  (5) 国泰君安证券股份有限公司杭州庆春路证券营业部                       14360581.23",""," 2、B股",""," 3、封闭式基金","","七、非ST、*ST和S证券连续三个交易日内收盘价格跌幅偏离值累计达到20%的证券:"," 1、A股","        证券代码  证券简称  累计偏离值%  累计成交量  累计成交金额(万元)  异常期间","    (1)  600058   五矿发展  +20.57%        72262379          226146.89  11.30-12.01","    (2)  600882   华联矿业  +20.57%        57471163           65805.30  11.30-12.01","    (3)  600137   浪莎股份  +20.56%        25674587          111290.57  11.30-12.01","","      证券代码: 600058                                            证券简称: 五矿发展","      ------------------------------------------------------------------------------","      买入营业部名称:                                              累计买入金额(元):","  (1) 华泰证券股份有限公司上海共和新路证券营业部                        209205569.32","  (2) 首创证券有限责任公司成都府城大道证券营业部                         50168222.00","  (3) 海通证券股份有限公司北京中关村南大街证券营业部                     44019387.68","  (4) 机构专用                                                           40878867.80","  (5) 国泰君安证券股份有限公司深圳益田路证券营业部                       33583800.00","","      卖出营业部名称:                                              累计卖出金额(元):","  (1) 华泰证券股份有限公司上海共和新路证券营业部                        188423423.63","  (2) 机构专用                                                          140633520.76","  (3) 机构专用                                                           81270841.80","  (4) 中信证券股份有限公司深圳总部证券营业部                             76213296.00","  (5) 中国国际金融有限公司客户资产管理部                                 71749830.80","","      证券代码: 600882                                            证券简称: 华联矿业","      ------------------------------------------------------------------------------","      买入营业部名称:                                              累计买入金额(元):","  (1) 国泰君安证券股份有限公司顺德东乐路证券营业部                       27737498.00","  (2) 华泰证券股份有限公司上海澳门路证券营业部                           20366618.80","  (3) 国泰君安证券股份有限公司上海福山路证券营业部                       15910944.00","  (4) 光大证券股份有限公司海口国贸大道证券营业部                         12446418.00","  (5) 平安证券有限责任公司深圳金田路证券营业部                           10979284.00","","      卖出营业部名称:                                              累计卖出金额(元):","  (1) 国海证券股份有限公司南宁教育路证券营业部                           38364658.40","  (2) 华泰证券股份有限公司上海澳门路证券营业部                           17907470.55","  (3) 国泰君安证券股份有限公司上海福山路证券营业部                       17474013.24","  (4) 招商证券股份有限公司深圳南山南油大道证券营业部                     16004356.73","  (5) 国泰君安证券股份有限公司顺德东乐路证券营业部                       13336922.25","","      证券代码: 600137                                            证券简称: 浪莎股份","      ------------------------------------------------------------------------------","      买入营业部名称:                                              累计买入金额(元):","  (1) 机构专用                                                           89876088.35","  (2) 机构专用                                                           44530114.00","  (3) 机构专用                                                           37886648.47","  (4) 机构专用                                                           25900888.18","  (5) 国金证券股份有限公司沈阳北陵大街证券营业部                         22808447.02","","      卖出营业部名称:                                              累计卖出金额(元):","  (1) 国金证券股份有限公司上海奉贤区金碧路证券营业部                     52950091.86","  (2) 招商证券股份有限公司青岛开发区长江中路证券营业部                   51959454.76","  (3) 中国银河证券股份有限公司上海长宁区镇宁路证券营业部                 40510057.13","  (4) 招商证券股份有限公司武汉中北路证券营业部                           40506774.66","  (5) 机构专用                                                           39693341.66",""," 2、B股",""," 3、封闭式基金","","八、ST、*ST和S证券连续三个交易日内收盘价格涨幅偏离值累计达到15%的证券:"," 1、A股",""," 2、B股","","九、ST、*ST和S证券连续三个交易日内收盘价格跌幅偏离值累计达到15%的证券:"," 1、A股",""," 2、B股","","十、连续三个交易日内的日均换手率与前五个交易日日均换手率的比值到达30倍,并且该股票封闭式","    基金连续三个交易日内累计换手率达到20%"," 1、A股",""," 2、B股",""," 3、封闭式基金","","十一、当日无价格涨跌幅限制的A股，出现异常波动停牌的:","","","十二、当日无价格涨跌幅限制的B股，出现异常波动停牌的:","","","十三、单只标的证券的当日融资买入数量达到当日该证券总交易量的50％以上:","","        证券代码     证券简称      成交占比%         成交量        成交金额(万元)","    (1)  510010        治理ETF        69.19%           59397               5.93","","      证券代码: 510010                                            证券简称: 治理ETF ","      ------------------------------------------------------------------------------","      融资买入会员名称:                                              融资买入金额(元):","  (1) 华泰证券股份有限公司                                                  27350.87","  (2) 国信证券股份有限公司                                                  11099.40","  (3) 兴业证券股份有限公司                                                   2426.40","  (4) 光大证券股份有限公司                                                    100.00","  (5) 安信证券股份有限公司                                                    100.00","","十四、单只标的证券的当日融券卖出数量达到当日该证券总交易量的50％以上:","","十五、风险警示股票盘中换手率达到或超过30%："," 1、A股",""," 2、B股","","十六、退市整理的证券："," 1、A股",""," 2、B股","","十七、实施特别停牌的证券:","  无","  ","  ","","                                                        上海证券交易所","\u001A"],"isPagination":"false","isTradeDate":null,"jsonCallBack":"jQuery172007153944508172572_1449041339239","locale":"en_US","pageHelp":{"beginPage":1,"cacheSize":5,"data":null,"endDate":null,"endPage":null,"objectResult":null,"pageCount":null,"pageNo":1,"pageSize":10,"searchDate":null,"sort":null,"startDate":null,"total":0},"result":null,"resultListDown":null,"resultListUp":null,"texts":null,"type":null,"validateCode":""})'''
js_data=data.split("({")[1].split("})")[0];
js_data="{"+js_data+"}"
ret_js=json.loads(js_data,encoding="utf-8")
print ret_js['dateTx'];
#print ret_js['fileContents']

lhblist=[]


file_lines=ret_js['fileContents']
sh.sh_gen_record_from(file_lines)

############################## 深 ＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃
#创业板
#curl 'http://www.szse.cn/szseWeb/common/szse/files/text/nmTxt/gk/nm_jy151201.txt?randnum=0.44545467011630535' -H 'Accept-Encoding: gzip, deflate, sdch' -H 'Accept-Language: en-US,en;q=0.8' -H 'User-Agent: Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/44.0.2403.125 Safari/537.36' -H 'Content-Type: application/x-www-form-urlencoded; charset=utf-8' -H 'Accept: */*' -H 'Referer: http://www.szse.cn/main/chinext/jygkxx/jygkxx/' -H 'Connection: keep-alive' --compressed
refstr='http://www.szse.cn/main/chinext/jygkxx/jygkxx/'
headers = { 'User-Agent' : user_agent,
			'Referer' : refstr,
			'Connection' : 'keep-alive',
			'Content-Type' : 'application/x-www-form-urlencoded; charset=utf-8',
			}
http_body = None
url='http://www.szse.cn/szseWeb/common/szse/files/text/nmTxt/gk/nm_jy151201.txt?randnum=0.44545467011630535'
#data=my_url_read_data(url, http_body, headers)[0]
#print data.decode('gbk');
#print type(data)
#print type(data.decode('gbk'))

data='''

                       深圳证券市场创业板交易公开信息
                                (2015年12月01日)

证券列表
--------------------------------------------------------------------------------
证券代码 证券简称              披露原因
300031   宝通科技 日价格跌幅偏离值达到-8.90%
300113   顺网科技 日价格跌幅偏离值达到-8.90%
300143   星河生物 日价格涨幅偏离值达到11.10%
300151   昌红科技 日价格涨幅偏离值达到11.10%
300191   潜能恒信 日价格跌幅偏离值达到-8.90%
300248   新开普   日价格跌幅偏离值达到-8.90%
300250   初灵信息 日价格振幅达到19.41%
300304   云意电气 日价格涨幅偏离值达到11.10%
300317   珈伟股份 日价格涨幅偏离值达到11.10%
300366   创意信息 日价格振幅达到20.71%
300368   汇金股份 日价格跌幅偏离值达到-8.90%
300410   正业科技 日换手率达到33.77%
300441   鲍斯股份 日价格振幅达到21.97%
300441   鲍斯股份 日换手率达到60.43%
300447   全信股份 日价格振幅达到21.43%
300448   浩云科技 日价格振幅达到19.94%
300448   浩云科技 异常期间价格涨幅偏离值累计达到20.01%
300467   迅游科技 日价格涨幅偏离值达到11.10%
300487   蓝晓科技 日换手率达到33.51%
300488   恒锋工具 日换手率达到34.78%
300489   中飞股份 日换手率达到37.35%
--------------------------------------------------------------------------------

详细信息
--------------------------------------------------------------------------------

日涨幅偏离值达到7%的前五只证券：

昌红科技(代码300151)  涨幅偏离值:11.10%  成交量:3244万股  成交金额: 54604万元

买入金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
华泰证券股份有限公司成都双流县正东中街证券营业部      23985318.00      146715.00
中信证券股份有限公司上海漕溪北路证券营业部            20320712.00       66280.00
华泰证券股份有限公司深圳益田路荣超商务中心证券营业    19717842.00     1156380.00
东方证券股份有限公司深圳金田路证券营业部              18472568.00           0.00
浙商证券股份有限公司宁波四明中路证券营业部            17058294.00       67906.00

卖出金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
华林证券有限责任公司开平东兴大道证券营业部               50186.00    17066140.96
华泰证券股份有限公司江阴分公司                          246711.00     9948859.00
中国银河证券股份有限公司杭州新塘路证券营业部                 0.00     7913830.00
方正证券股份有限公司北京阜外大街证券营业部                   0.00     7428670.00
国信证券股份有限公司深圳泰然九路证券营业部             1088138.74     7049271.00

星河生物(代码300143)  涨幅偏离值:11.10%  成交量:1129万股  成交金额: 30389万元

买入金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
招商证券股份有限公司上海世纪大道证券营业部            40438958.73       79083.00
机构专用                                              22816473.19           0.00
中国中投证券有限责任公司无锡清扬路证券营业部          21315837.77           0.00
海通证券股份有限公司北京中关村南大街证券营业部        16631147.95           0.00
国联证券股份有限公司上海邯郸路证券营业部               8355433.80           0.00

卖出金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
机构专用                                                     0.00    20674800.00
广发证券股份有限公司深圳新安二路证券营业部                   0.00    12470571.00
国泰君安证券股份有限公司合肥长江西路证券营业部          158142.00    11127421.50
上海华信证券有限责任公司上海仙霞路证券营业部                 0.00    10802157.76
渤海证券股份有限公司上海定西路证券营业部               2849715.00     5441794.97

珈伟股份(代码300317)  涨幅偏离值:11.10%  成交量:568万股  成交金额: 11342万元

买入金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
中国国际金融股份有限公司上海淮海中路证券营业部       112383172.00           0.00
华泰证券股份有限公司上海静安区威海路证券营业部         1038080.54           0.00

卖出金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
西南证券股份有限公司唐山新华西道证券营业部                   0.00    54737770.00
华泰证券股份有限公司深圳竹子林四路证券营业部                 0.00    33283999.00
宏信证券有限责任公司北京雅宝路证券营业部                     0.00    24361403.00
中国银河证券股份有限公司成都建设路证券营业部                 0.00      750872.00
机构专用                                                     0.00       77883.00

云意电气(代码300304)  涨幅偏离值:11.10%  成交量:480万股  成交金额: 11209万元

买入金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
天风证券股份有限公司上海芳甸路证券营业部              14349168.00           0.00
国泰君安证券股份有限公司上海分公司                     9167341.38           0.00
海通证券股份有限公司南京广州路证券营业部               7145193.00           0.00
华泰证券股份有限公司南京解放路证券营业部               6738776.68      190560.00
机构专用                                               4959898.00           0.00

卖出金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
东方证券股份有限公司深圳深南大道证券营业部                   0.00    13101000.00
西藏同信证券股份有限公司北京陶然亭路证券营业部               0.00     3470574.00
海通证券股份有限公司深圳福华三路证券营业部                   0.00     2858400.00
万和证券有限责任公司深圳笋岗东路证券营业部                   0.00     2632780.00
国都证券股份有限公司北京北三环中路证券营业部             22805.00     2278694.00

迅游科技(代码300467)  涨幅偏离值:11.10%  成交量:88万股  成交金额: 9365万元

买入金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
兴业证券股份有限公司南京珠江路证券营业部              25351456.00           0.00
湘财证券股份有限公司上海金杨路证券营业部              16259386.00           0.00
兴业证券股份有限公司厦门兴隆路证券营业部              14185756.00      287118.00
华宝证券有限责任公司杭州玉古路证券营业部              14175122.00           0.00
东莞证券股份有限公司扬州兴城西路证券营业部            12420512.00           0.00

卖出金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
机构专用                                                     0.00    39303264.00
方正证券股份有限公司宁波解放北路证券营业部                   0.00     8092474.00
华泰证券股份有限公司深圳竹子林四路证券营业部                 0.00     7699016.00
国泰君安证券股份有限公司上海静安区南京西路证券营业           0.00     6040112.00
万联证券有限责任公司绍兴解放南路证券营业部                   0.00     4508816.00

--------------------------------------------------------------------------------

日跌幅偏离值达到7%的前五只证券：

潜能恒信(代码300191)  跌幅偏离值:-8.90%  成交量:2414万股  成交金额: 115430万元

买入金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
中国银河证券股份有限公司杭州新塘路证券营业部          30979395.00       29150.00
中信证券股份有限公司杭州东新路证券营业部              23283848.00      561223.00
海通证券股份有限公司郑州经七路证券营业部              21061269.50     1597199.00
宏源证券股份有限公司长沙韶山北路证券营业部            11610495.00       82093.00
国泰君安证券股份有限公司上海威海路证券营业部           9922069.95     6583843.53

卖出金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
国元证券股份有限公司上海虹桥路证券营业部                235997.00    79166933.31
中信建投证券股份有限公司宜昌市解放路证券营业部           13779.00    30396083.00
中国银河证券股份有限公司绍兴证券营业部                 1335965.00    27083565.15
光大证券股份有限公司宁波中山西路证券营业部              410976.00    25600214.00
中国中投证券有限责任公司无锡清扬路证券营业部            131515.00    20832549.00

顺网科技(代码300113)  跌幅偏离值:-8.90%  成交量:1013万股  成交金额: 94213万元

买入金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
机构专用                                              95300449.64           0.00
国元证券股份有限公司上海虹桥路证券营业部              28343692.34    21726315.16
机构专用                                              19258357.08           0.00
机构专用                                              18930655.44           0.00
机构专用                                              18682169.40           0.00

卖出金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
光大证券股份有限公司宁波中山西路证券营业部              217959.00    40070555.90
机构专用                                                     0.00    36364117.49
中国中投证券有限责任公司无锡清扬路证券营业部                 0.00    30709899.40
国泰君安证券股份有限公司宁波彩虹北路证券营业部          367238.00    29431730.35
国泰君安证券股份有限公司上海分公司                           0.00    24132431.10

宝通科技(代码300031)  跌幅偏离值:-8.90%  成交量:3025万股  成交金额: 92141万元

买入金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
机构专用                                              69293439.74           0.00
国泰君安证券股份有限公司宁波彩虹北路证券营业部        31344361.70     5826847.97
机构专用                                              26777751.27           0.00
华安证券股份有限公司上海浦东南路证券营业部            20696311.00           0.00
兴业证券股份有限公司福州湖东路证券营业部              18860530.41      315060.00

卖出金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
国泰君安证券股份有限公司重庆新南路证券营业部           2207720.00    76448224.96
国泰君安证券股份有限公司上海银城中路证券营业部         6447914.96    46381781.61
国金证券股份有限公司上海长宁区延安西路证券营业部         51120.00    36917669.44
机构专用                                                     0.00    28896803.34
机构专用                                                     0.00    28880792.00

新开普(代码300248)  跌幅偏离值:-8.90%  成交量:2255万股  成交金额: 87453万元

买入金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
机构专用                                              20366387.42           0.00
宏源证券股份有限公司北京紫竹院路证券营业部            19666426.65       37000.00
渤海证券股份有限公司苏州景德路证券营业部              17677311.10           0.00
广发证券股份有限公司上海西藏南路证券营业部            12092786.00      380696.00
机构专用                                              11731181.00           0.00

卖出金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
东方证券股份有限公司上海浦东新区银城中路证券营业部           0.00    29008464.00
华泰证券股份有限公司武汉新华路证券营业部                  8050.00    23042551.70
东方证券股份有限公司上海浦东南路证券营业部               72200.00    18233424.00
华泰证券股份有限公司无锡苏锡路证券营业部                851130.00    17309709.17
东方证券股份有限公司上海浦东新区牡丹路证券营业部          4051.00    16128000.00

汇金股份(代码300368)  跌幅偏离值:-8.90%  成交量:2147万股  成交金额: 77462万元

买入金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
国元证券股份有限公司北京东直门外大街证券营业部        19392740.00           0.00
招商证券股份有限公司深圳深南中路证券营业部             7010925.94       18010.00
东兴证券股份有限公司惠安建设南路证券营业部             6219710.00           0.00
财通证券股份有限公司绍兴县柯桥湖西路证券营业部         5538206.80        7522.00
兴业证券股份有限公司泉州丰泽街证券营业部               5537928.00       71917.00

卖出金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
中国中投证券有限责任公司广州体育东路证券营业部           54192.00    48197124.74
申万宏源证券有限公司深圳金田路证券营业部                     0.00    28748279.20
国海证券股份有限公司桂林中山中路证券营业部              416410.00    18684572.00
广发证券股份有限公司杭州市天目山路证券营业部                 0.00    16096769.11
华泰证券股份有限公司盐城分公司                          701160.00    15226653.50

--------------------------------------------------------------------------------

日振幅值达到15%的前五只证券：

鲍斯股份(代码300441)  振幅值:21.97%  成交量:2553万股  成交金额: 161080万元

买入金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
财通证券股份有限公司温岭东辉北路证券营业部            39628711.00     1411957.50
国联证券股份有限公司宜兴人民南路证券营业部            26221902.60      523246.00
广发证券股份有限公司中山兴中道证券营业部              18145119.84     4713118.00
华泰证券股份有限公司重庆春晖路证券营业部              16747419.00    12527464.00
长城证券股份有限公司仙桃钱沟路证券营业部              15771629.69       11872.00

卖出金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
兴业证券股份有限公司南宁民族大道证券营业部               11618.00    61443734.25
华西证券股份有限公司广州珠江东路证券营业部               95211.00    46781003.92
华泰证券股份有限公司舟山解放东路证券营业部              209941.00    33568114.00
中国中投证券有限责任公司南京太平南路证券营业部          214820.00    33556043.23
江海证券有限公司哈尔滨邮政街证券营业部                  154410.00    28946326.00

全信股份(代码300447)  振幅值:21.43%  成交量:672万股  成交金额: 85569万元

买入金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
国泰君安证券股份有限公司上海银城中路证券营业部        16484114.60           0.00
国海证券股份有限公司济南济安街证券营业部              14933051.00      109600.00
国海证券股份有限公司济宁邹城市兴石街证券营业部        13408039.00           0.00
西南证券股份有限公司福州井大路证券营业部              12738119.96     1160331.00
中信建投证券股份有限公司广州中山三路证券营业部        10273119.76       12653.00

卖出金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
机构专用                                                     0.00    36684962.23
机构专用                                                     0.00    25536674.00
中信建投证券股份有限公司福州东街证券营业部               36000.00    19860819.88
兴业证券股份有限公司上海金陵东路证券营业部               99270.00    13039068.00
东兴证券股份有限公司福州五一中路证券营业部             1996686.88    10987699.33

创意信息(代码300366)  振幅值:20.71%  成交量:777万股  成交金额: 55195万元

买入金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
长江证券股份有限公司成都人民南路证券营业部            24932461.00           0.00
西部证券股份有限公司西安东大街证券营业部              18936878.80           0.00
兴业证券股份有限公司上海金陵东路证券营业部            17737754.00     6311639.22
国泰君安证券股份有限公司上海福山路证券营业部          12936884.00       44452.00
中信证券股份有限公司北京建国门证券营业部              12610176.00      150351.00

卖出金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
兴业证券股份有限公司杭州清泰街证券营业部                 20289.00    57259555.35
东海证券股份有限公司宁波大闸路证券营业部                     0.00    41762769.80
国泰君安证券股份有限公司上海分公司                           0.00    24315675.00
中信证券股份有限公司深圳深南大道证券营业部                6747.00    23166073.00
中信建投证券股份有限公司常州延陵西路证券营业部           66214.00    17978601.93

浩云科技(代码300448)  振幅值:19.94%  成交量:667万股  成交金额: 84430万元

买入金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
机构专用                                              83902242.94           0.00
东北证券股份有限公司北京朝外大街证券营业部            14632007.01      503862.00
华福证券有限责任公司厦门仙岳路证券营业部              12900928.00       13480.00
机构专用                                              11571178.00           0.00
中国银河证券股份有限公司绍兴证券营业部                10406678.00     4113347.50

卖出金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
华泰证券股份有限公司深圳竹子林四路证券营业部            672856.36    29504365.00
中信建投证券股份有限公司福州东街证券营业部              403003.00    16691316.72
光大证券股份有限公司长沙人民中路证券营业部                   0.00    12910002.21
上海证券有限责任公司乐都路证券营业部                    124279.00    11841982.00
招商证券股份有限公司北京知春东里证券营业部             2176153.00     7851151.60

初灵信息(代码300250)  振幅值:19.41%  成交量:809万股  成交金额: 64936万元

买入金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
中信证券股份有限公司中山中山四路证券营业部            46759020.00           0.00
机构专用                                              41751598.00           0.00
中泰证券股份有限公司深圳吉祥路证券营业部              33594020.00      459772.00
机构专用                                              25715627.46           0.00
机构专用                                              23429407.28           0.00

卖出金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
上海证券有限责任公司大连同兴街证券营业部                     0.00    95411358.70
信达证券股份有限公司大连中山路证券营业部                     0.00    49475391.51
中泰证券股份有限公司上海西安路证券营业部                340300.00     9973252.00
招商证券股份有限公司深圳沙头角金融路证券营业部               0.00     7631067.00
湘财证券股份有限公司北京北四环东路证券营业部              8000.00     6141395.00

--------------------------------------------------------------------------------

日换手率达到20%的前五只证券：

鲍斯股份(代码300441)  换手率:60.43%  成交量:2553万股  成交金额: 161080万元

买入金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
财通证券股份有限公司温岭东辉北路证券营业部            39628711.00     1411957.50
国联证券股份有限公司宜兴人民南路证券营业部            26221902.60      523246.00
广发证券股份有限公司中山兴中道证券营业部              18145119.84     4713118.00
华泰证券股份有限公司重庆春晖路证券营业部              16747419.00    12527464.00
长城证券股份有限公司仙桃钱沟路证券营业部              15771629.69       11872.00

卖出金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
兴业证券股份有限公司南宁民族大道证券营业部               11618.00    61443734.25
华西证券股份有限公司广州珠江东路证券营业部               95211.00    46781003.92
华泰证券股份有限公司舟山解放东路证券营业部              209941.00    33568114.00
中国中投证券有限责任公司南京太平南路证券营业部          214820.00    33556043.23
江海证券有限公司哈尔滨邮政街证券营业部                  154410.00    28946326.00

中飞股份(代码300489)  换手率:37.35%  成交量:424万股  成交金额: 50985万元

买入金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
湘财证券股份有限公司济南马鞍山路证券营业部             9195156.00     2669676.00
华鑫证券有限责任公司上海松江证券营业部                 7981415.00     5658168.00
平安证券有限责任公司北京东花市证券营业部               6950500.00       12401.00
上海证券有限责任公司乐清柳市惠丰路证券营业部           5918713.00       12596.00
华泰证券股份有限公司天津白堤路证券营业部               5038569.92     2303284.90

卖出金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
中国中投证券有限责任公司宁波江东北路证券营业部               0.00   110636222.90
中信建投证券股份有限公司福州东街证券营业部              119253.00    15318386.00
华鑫证券有限责任公司常州晋陵中路证券营业部             1721803.45     8753804.00
华泰证券股份有限公司武汉新华路证券营业部                 25150.00     8528941.00
长城证券股份有限公司厦门凤山路证券营业部                     0.00     6748935.60

恒锋工具(代码300488)  换手率:34.78%  成交量:435万股  成交金额: 46614万元

买入金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
光大证券股份有限公司南昌广场南路证券营业部            11364818.00           0.00
恒泰证券股份有限公司杭州凤起路证券营业部              11264750.00      184960.00
华泰证券股份有限公司南京中央路第三证券营业部           5553762.00       72495.00
华泰证券股份有限公司成都蜀金路证券营业部               5385557.50     7098763.00
广发证券股份有限公司北京广安门内大街证券营业部         4751442.00           0.00

卖出金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
华泰证券股份有限公司上海黄浦区来福士广场证券营业部      161635.00    17404911.00
中信证券股份有限公司宁波中山东路证券营业部              106348.00    14327741.95
招商证券股份有限公司北京朝外大街证券营业部               32166.00    10795726.00
招商证券股份有限公司晋江和平中路证券营业部                   0.00     7542041.00
华泰证券股份有限公司成都蜀金路证券营业部               5385557.50     7098763.00

正业科技(代码300410)  换手率:33.77%  成交量:507万股  成交金额: 67816万元

买入金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
兴业证券股份有限公司杭州清泰街证券营业部              92853605.00       12550.00
国泰君安证券股份有限公司顺德大良证券营业部            46069896.68           0.00
中国银河证券股份有限公司宁波大庆南路证券营业部        21600947.00      161501.00
国海证券股份有限公司桂林中山中路证券营业部            11923556.00    18581427.24
中信建投证券股份有限公司福州东街证券营业部            10833377.50           0.00

卖出金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
兴业证券股份有限公司成都航空路证券营业部                 39891.00    22733947.00
华泰证券股份有限公司深圳益田路荣超商务中心证券营业    10200630.00    22512271.80
国海证券股份有限公司桂林中山中路证券营业部            11923556.00    18581427.24
中信证券股份有限公司中山中山四路证券营业部                   0.00    14301401.40
财达证券有限责任公司石家庄新华路证券营业部                   0.00    13672818.00

蓝晓科技(代码300487)  换手率:33.51%  成交量:670万股  成交金额: 48810万元

买入金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
广发证券股份有限公司泉州涂门街证券营业部              14020580.00           0.00
海通证券股份有限公司哈尔滨中山路证券营业部             7554353.00      151472.00
中信建投证券股份有限公司北京东直门南大街证券营业部     7255013.00      406405.50
安信证券股份有限公司汕头金砂路第一证券营业部           5620361.00      562356.00
华泰证券股份有限公司绍兴上大路证券营业部               5373697.50      166395.00

卖出金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
中国银河证券股份有限公司宁波解放南路证券营业部          167530.00    22211175.60
华泰证券股份有限公司上海黄浦区来福士广场证券营业部       71916.00    19293199.50
中信证券股份有限公司上海漕溪北路证券营业部              136889.00    13409153.50
华福证券有限责任公司厦门分公司                            7050.00     7778086.00
华泰证券股份有限公司武汉新华路证券营业部                     0.00     7524336.70

--------------------------------------------------------------------------------

无价格涨跌幅限制的证券：无

--------------------------------------------------------------------------------

连续三个交易日内，涨幅偏离值累计达到20%的证券：

浩云科技(代码300448)              成交量:1674万股  成交金额:199993万元
异常期间:2015/11/27至2015/12/01   累计涨幅偏离值:20.01%

买入金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
机构专用                                              83902242.94           0.00
光大证券股份有限公司长沙人民中路证券营业部            30415380.70    31499111.86
华泰证券股份有限公司深圳竹子林四路证券营业部          29467406.36    29618295.00
东北证券股份有限公司北京朝外大街证券营业部            24806205.45    19228295.60
国泰君安证券股份有限公司西安高新路证券营业部          18078918.80      541156.80

卖出金额最大的前5名

营业部或交易单元名称                                  买入金额(元)  卖出金额(元)
光大证券股份有限公司长沙人民中路证券营业部            30415380.70    31499111.86
华泰证券股份有限公司深圳竹子林四路证券营业部          29467406.36    29618295.00
东北证券股份有限公司北京朝外大街证券营业部            24806205.45    19228295.60
中信建投证券股份有限公司福州东街证券营业部            15393060.00    17601916.72
机构专用                                                     0.00    14899571.32

--------------------------------------------------------------------------------

连续三个交易日内，跌幅偏离值累计达到20%的证券：无

--------------------------------------------------------------------------------

连续三个交易日内，涨幅偏离值累计达到12%的ST证券、*ST证券：无

--------------------------------------------------------------------------------

连续三个交易日内，跌幅偏离值累计达到12%的ST证券、*ST证券：无

--------------------------------------------------------------------------------

连续三个交易日内，
日均换手率与前五个交易日的日均换手率的比值达到30倍，且换手率累计达20%的证券：无

--------------------------------------------------------------------------------

其它异常波动的证券：无

--------------------------------------------------------------------------------

'''

print type(data)
print len(data)
data=data.split("\n")
sz.sz_gen_record_from_data(data)

gen_excel.excel_do_gen()


